foamfiles/counterFlowFlame2D/case_5185185185/0/details
Velocity
51.85185185